wiki/2016-07-25-MySQL调用JDBC查询数据全部加载的问题.html
<!DOCTYPE html>
<html lang="zh">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://bruceasu.github.io/rss.xml"
      title="RSS feed for https://bruceasu.github.io/"/>
<title>MySQL调用JDBC查询数据全部加载的问题</title>
<meta name="author" content="Bruce">
<meta name="referrer" content="no-referrer">
<link href= "/styles/org-manual.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rel="stylesheet" href="/styles/font.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/post.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/post_mobile.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/navigatebar.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/navigatebar_mobile.css">
<link rel="stylesheet" href="/theme/highlight.css">

</head>
<body>
<div class="navigatebar">
    <div class="navigatebar-button navigatebar-mine">
        <a href="/index.html">Free World</a>
    </div>
    <div class="navigatebar-slogan">
        「生活可以更简单, 欢迎来到我的开源世界」
    </div>
    <div class="navigatebar-button">
        <a href="/index.html">Home</a>
    </div>
    <div class="navigatebar-button">
        <a href="/tags.html">Tags</a>
    </div>
    <div class="navigatebar-button">
        <a href="/rss.xml">Feeds</a>
    </div>
    <div class="navigatebar-button navigatebar-about">
        <a href="/about.html">About</a>
    </div>
</div>

      <div class="content-area">
<div class="title">MySQL调用JDBC查询数据全部加载的问题</div>
<div class="category-area"><a href="https://bruceasu.github.io/tags.html#mysql"><div class="category">mysql</div></a> </div>
<div class="char-counter">2016-07-25</div>
        <div id="content">
<p>
之前在建立 Statement 或 PreparedStatement，您所使用的 是Connection 无参数的
createStatement() 与 preparedStatement()，这样取得的 Statement 其执行SQL后得到的
ResultSet，将只能使用 next() 方法逐笔取得查询结果。
</p>

<p>
您可以在建立 Statement 对象时指定 resultSetType，可指定的参数有
</p>

<ul class="org-ul">
<li><code>ResultSet.TYPE_FORWARD_ONLY</code></li>
<li><code>ResultSet.TYPE_SCROLL_INSENSITIVE</code></li>
<li><code>ResultSet.TYPE_SCROLL_SENSITIVE</code></li>
</ul>

<p>
在不指定的情况下，预设是第一个，也就是只能使用 next() 来逐笔取得资料，指定第二个
或第三个，则可以使用 ResultSet 的 afterLast()、previous()、absolute()、
relative() 等方法。
</p>

<p>
<code>ResultSet.TYPE_SCROLL_INSENSITIVE</code> 与 <code>ResultSet.TYPE_SCROLL_SENSITIVE</code> 的差别在于
能否取得 ResultSet 改变值后的资料，另外您还必须指定 resultSetConcurrency，有
<code>ResultSet.CONCUR_READ_ONLY</code> 与 <code>ResultSet.CONCUR_UPDATABLE</code> 两个参数可以设定，前者
表示只能读取 ResultSet 的资料，后者表示可以直接使用 ResultSet 来操作数据库，这会
在下一个主题后说明。
</p>

<p>
createStatement() 不给定参数时，预设是 <code>ResultSet.TYPE_FORWARD_ONLY</code> 、
<code>ResultSet.CONCUR_READ_ONLY</code> 。
</p>

<p>
这边先示范如何控制 ResultSet 的读取游标，在建立 Statement 时，您使用
<code>ResultSet.TYPE_SCROLL_INSENSITIVE</code> 及 <code>ResultSet.CONCUR_READ_ONLY</code> 即可，下面这个例
子示范从查询到的资料最后一笔开始往前读取：
</p>
<div class="org-src-container">
<pre class="src src-java">
<span style="font-weight: bold; text-decoration: underline;">Statement</span> <span style="font-weight: bold; font-style: italic;">stmt</span> = conn.createStatement(
<span style="font-weight: bold; text-decoration: underline;">ResultSet</span>.TYPE_SCROLL_INSENSITIVE,
<span style="font-weight: bold; text-decoration: underline;">ResultSet</span>.CONCUR_READ_ONLY);
<span style="font-weight: bold; text-decoration: underline;">ResultSet</span> <span style="font-weight: bold; font-style: italic;">result</span> = stmt.executeQuery(
<span style="font-style: italic;">"SELECT * FROM message"</span>);
result.afterLast();
<span style="font-weight: bold;">while</span>(result.previous()) {
System.out.print(result.getString(<span style="font-style: italic;">"name"</span>) + <span style="font-style: italic;">"\t"</span>);
System.out.print(result.getString(<span style="font-style: italic;">"email"</span>) + <span style="font-style: italic;">"\t"</span>);
System.out.print(result.getString(<span style="font-style: italic;">"subject"</span>) + <span style="font-style: italic;">"\t"</span>);
System.out.print(result.getString(<span style="font-style: italic;">"time"</span>) + <span style="font-style: italic;">"\t"</span>);
System.out.println(result.getString(<span style="font-style: italic;">"memo"</span>) + <span style="font-style: italic;">"\t"</span>);
}
stmt.close();
conn.close();

</pre>
</div>

<p>
afterLast() 会将 ResultSet 的读取游标移至最后一笔资料之后，您使用 previous() 方
法往前移动读取游标。
</p>

<p>
您也可以使用 absolute() 方法指定查询到的资料之位置，例如 absolute(4) 表示第四笔
资料，absoulte(10) 则是第十笔资料，如果指定负数，则从最后往前数，例如
absolute(-1) 则是最后一笔资料，若有 100 笔资料，absoulte(-4) 则是第 97 笔资料。
</p>

<p>
relative() 方法则从目前游标处指定相对位置，例如若目前在第 25 笔数据，则
relative(-2)则表示第 23 笔资料，而 relative (4) 则表示第 29 笔资料。
</p>

<p>
另外有还 beforeFirst()，可以将游标移至数据的第一笔之前，first() 可以将游标移至第
一笔数据，而 last() 可以将游标移至最后一笔数据。
</p>


<p>
默认情况下，MySQL 的 JDBC 驱动会一下子把所有 row 都读取下来，这在一般情况下是最
优的，因为可以减少 Client-Server 的通信开销。但是这样也有一个问题，当数据库查询
结果很大时，特别当不能全部放进内存时，就会产生性能问题。
</p>

<p>
本来，JDBC api里在 Connection、Statement 和 ResultSet 上都有设置 fetchSize 的方
法，但是 MySQL 的 JDBC 驱动都不支持，无论你怎么设 fetchSize，ResultSet 都会一次
性从 Server 读取数据。在 MySQL 的官方论坛上也有多个这样的问题，总结一下解决办法
如下：
</p>

<ol class="org-ol">
<li>MySQL版本在5.0以上，MySQL的JDBC驱动更新到最新版本(至少5.0以上)</li>
<li>Statement一定是 <code>TYPE_FORWARD_ONLY</code> 的，并发级别是 <code>CONCUR_READ_ONLY</code> (即创建
Statement的默认参数)</li>
<li>以下两句语句选一即可：
<ol class="org-ol">
<li>statement.setFetchSize(Integer.MIN_VALUE);</li>
<li>((com.mysql.jdbc.Statement)stat).enableStreamingResults();</li>
</ol></li>
</ol>

<p>
这样会一行一行地从 Server 读取数据，因此通信开销很大，但内存问题可以解决。官方的
说法是不支持 fetchSize 不是 MySQL 的 JDBC 驱动的问题，而是 MySQL 本身就不支持。
而商用数据库 Oracle 或 DB2 都是支持 fetchSize 的，从这里也可以看出两者的考量不同。
</p>

        </div>    </div>
    <div id="postamble" class="status"><div id="archive" style="padding-top: 3em; padding-bottom: 2em;"><a href="/archive.html">其它文章</a></div><script src="/js/av-min-1.5.0.js"></script>    </div>
</body>
</html>
